In [2]:
# Another way to import numpy functions
from numpy import sum,array

sum(array([1,2,3,4,5,6,7,8,9]))

45

#### Todays Adenda Pandas

In [44]:
- Pandas 
    -> Series #Single row/column
    -> DataFrame #Combination of rows and columns
- for easy acessing and moving data into the file thats why we r moving to pandas
- It arranges data in dataframes

IndentationError: unexpected indent (<ipython-input-44-1581668f115a>, line 2)

In [5]:
import pandas as pd
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [6]:
print(len(dir(pd)))

140

In [9]:
pd.__version__

'1.1.3'

# Pandas Series

In [11]:
mydata=np.arange(10,100,10)
print(mydata)

[10 20 30 40 50 60 70 80 90]

In [12]:
mypopu_data=pd.Series(mydata)
print(mypopu_data)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int32

In [ ]:
mypopu_data.name="Population"

In [16]:
mypopu_data[4]

50

In [15]:
mypopu_data.name

mypopu_data.dtype

dtype('int32')

In [ ]:
import pandas as pd
import numpy as np
g7_pop=pd.Series([35.345,44.444,23.456,12.321,98.625])

In [17]:
mypopu_data[::3]

0    10
3    40
6    70
dtype: int32

In [24]:
g7_pop.values
g7_pop

0    35.345
1    44.444
2    23.456
3    12.321
4    98.625
dtype: float64

In [21]:
type(g7_pop.values)

numpy.ndarray

In [25]:
g7_pop.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
mypopu_data.index

RangeIndex(start=0, stop=9, step=1)

In [27]:
mypopu_data.index=['a','b','c','d','e','f','g','h','i']

In [28]:
mypopu_data

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
i    90
dtype: int32

In [ ]:
g7_pop.index=['canada','hampi','Madhurai','Rameshwaram','Banglore','Chennai','Hyd','Nlr','US']

In [29]:
g7_pop

0    35.345
1    44.444
2    23.456
3    12.321
4    98.625
dtype: float64

In [30]:
pd.Series(mydata)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int32

In [31]:
mydt2=pd.Series('canada':12.345,'Italy':34.567,'US':45.678, name='g7 population')
print(mydt2)

SyntaxError: invalid syntax (<ipython-input-31-f9c6ebec5984>, line 1)

In [32]:
import pandas as pd
import numpy as np

In [35]:
R= pd.Series(np.array([2,3,4,5,6,7,8]),index=[1,2,3,4,5,6,7])
R

1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int32

In [41]:
L=pd.Series(np.array([2,3,4,5,6,7,8]),index=['a','b','c','d','e','f','g'])
L

a    2
b    3
c    4
d    5
e    6
f    7
g    8
dtype: int32

In [ ]:
R.name="Numerical"

In [37]:
R

1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int32

In [48]:
M= pd.Series(np.array([2,3,4,5,6,7,8]),index=['a','b','c','d','e','f','g'],name='Roll No',dtype='float')
M

a    2.0
b    3.0
c    4.0
d    5.0
e    6.0
f    7.0
g    8.0
Name: Roll No, dtype: float64

In [42]:
help(np)

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [49]:
D={'Ravi':98,'Raki':76,'ramki':89,'Ram':45,'Raghav':65}
D.keys()

dict_keys(['Ravi', 'Raki', 'ramki', 'Ram', 'Raghav'])

In [50]:
D.values()

dict_values([98, 76, 89, 45, 65])

In [51]:
D.items()

dict_items([('Ravi', 98), ('Raki', 76), ('ramki', 89), ('Ram', 45), ('Raghav', 65)])

In [54]:
Marks=pd.Series(D,name='S Marks',dtype='str')
print(Marks)

Ravi      98
Raki      76
ramki     89
Ram       45
Raghav    65
Name: S Marks, dtype: object

In [66]:
Marks['Ravi']

'98'

In [67]:
Marks['Ravi':'Raghav']

Ravi      98
Raki      76
ramki     89
Ram       45
Raghav    65
Name: S Marks, dtype: object

In [ ]:
# iloc-Values
# loc-positions

Marks.iloc[0]

In [69]:
Marks.loc['Raghav']

'65'

In [70]:
Marks.iloc[0]

'98'

In [71]:
Marks.iloc[0:4]

Ravi     98
Raki     76
ramki    89
Ram      45
Name: S Marks, dtype: object

In [72]:
import random

In [77]:
random.randint(1,10)

8

In [76]:
random.randint(100,300)

295

In [78]:
b=pd.Series(np.array([2,3,4,5,6,7,7,89]),index=list('ABCDEFGH'),name='Grades')
b

A     2
B     3
C     4
D     5
E     6
F     7
G     7
H    89
Name: Grades, dtype: int32

In [81]:
b[b>=4]

C     4
D     5
E     6
F     7
G     7
H    89
Name: Grades, dtype: int32

In [82]:
b*5

A     10
B     15
C     20
D     25
E     30
F     35
G     35
H    445
Name: Grades, dtype: int32

In [83]:
b.mean()

15.375

In [85]:
b['A':'D'].mean()

3.5

In [87]:
b['A']=9
b

A     9
B     3
C     4
D     5
E     6
F     7
G     7
H    89
Name: Grades, dtype: int32

#### DATA FRAMES

In [95]:
ms_marks={'Sub1':[98,97,99,87,88,83,72,74,71,65],'Sub2':[98,99,90,98,80,87,89,86,67,76],'Sub3':[100,90,80,70,60,50,40,30,20,10],'Sub4':[100,6,8,90,3,4,67,89,50,20]}

In [96]:
marks=pd.DataFrame(ms_marks,index=['Yathisha','Sushma','Bhargavi','Bhavani','Jyothsna','Sahithi','Sweety','Harini','Paddu','Varsham'])
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Sweety      72    89    40    67
Harini      74    86    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [103]:
marks.loc[['Yathisha','Sushma']]

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6

In [105]:
marks.loc['Yathisha'].sum()

396

In [106]:
marks.loc['Yathisha'].mean()

99.0

In [108]:
marks.index

Index(['Yathisha', 'Sushma', 'Bhargavi', 'Bhavani', 'Jyothsna', 'Sahithi',
       'Sweety', 'Harini', 'Paddu', 'Varsham'],
      dtype='object')

In [109]:
marks.columns

Index(['Sub1', 'Sub2', 'Sub3', 'Sub4'], dtype='object')

In [110]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Yathisha to Varsham
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sub1    10 non-null     int64
 1   Sub2    10 non-null     int64
 2   Sub3    10 non-null     int64
 3   Sub4    10 non-null     int64
dtypes: int64(4)
memory usage: 720.0+ bytes

In [111]:
marks.size

40

In [112]:
marks.shape

(10, 4)

In [113]:
marks.describe()

            Sub1       Sub2        Sub3        Sub4
count  10.000000  10.000000   10.000000   10.000000
mean   83.400000  87.000000   55.000000   43.700000
std    12.411464  10.381608   30.276504   40.052882
min    65.000000  67.000000   10.000000    3.000000
25%    72.500000  81.500000   32.500000    6.500000
50%    85.000000  88.000000   55.000000   35.000000
75%    94.750000  96.000000   77.500000   83.500000
max    99.000000  99.000000  100.000000  100.000000

In [115]:
marks['Sub1']

Yathisha    98
Sushma      97
Bhargavi    99
Bhavani     87
Jyothsna    88
Sahithi     83
Sweety      72
Harini      74
Paddu       71
Varsham     65
Name: Sub1, dtype: int64

In [120]:
marks[['Sub1','Sub4']]

          Sub1  Sub4
Yathisha    98   100
Sushma      97     6
Bhargavi    99     8
Bhavani     87    90
Jyothsna    88     3
Sahithi     83     4
Sweety      72    67
Harini      74    89
Paddu       71    50
Varsham     65    20

In [121]:
marks[marks>70]

          Sub1  Sub2   Sub3   Sub4
Yathisha  98.0  98.0  100.0  100.0
Sushma    97.0  99.0   90.0    NaN
Bhargavi  99.0  90.0   80.0    NaN
Bhavani   87.0  98.0    NaN   90.0
Jyothsna  88.0  80.0    NaN    NaN
Sahithi   83.0  87.0    NaN    NaN
Sweety    72.0  89.0    NaN    NaN
Harini    74.0  86.0    NaN   89.0
Paddu     71.0   NaN    NaN    NaN
Varsham    NaN  76.0    NaN    NaN

In [134]:
marks.Sub1['Varsham']

65

In [135]:
marks.iloc[3][0]

87

In [137]:
marks.iloc[0][0:3]

Sub1     98
Sub2     98
Sub3    100
Name: Yathisha, dtype: int64

In [138]:
marks.iloc[5][2]

50

In [143]:
marks['Sub5']=[99,79,69,59,49,67,89,88,57,35]

In [144]:
marks

          Sub1  Sub2  Sub3  Sub4  Sub5
Yathisha    98    98   100   100    99
Sushma      97    99    90     6    79
Bhargavi    99    90    80     8    69
Bhavani     87    98    70    90    59
Jyothsna    88    80    60     3    49
Sahithi     83    87    50     4    67
Sweety      72    89    40    67    89
Harini      74    86    30    89    88
Paddu       71    67    20    50    57
Varsham     65    76    10    20    35

In [147]:
# how to drop columns
marks.drop(columns='Sub5')

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Sweety      72    89    40    67
Harini      74    86    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [148]:
marks

          Sub1  Sub2  Sub3  Sub4  Sub5
Yathisha    98    98   100   100    99
Sushma      97    99    90     6    79
Bhargavi    99    90    80     8    69
Bhavani     87    98    70    90    59
Jyothsna    88    80    60     3    49
Sahithi     83    87    50     4    67
Sweety      72    89    40    67    89
Harini      74    86    30    89    88
Paddu       71    67    20    50    57
Varsham     65    76    10    20    35

In [158]:
marks.drop(columns ='Sub5',axis=1,inplace=True)

KeyError: "['Sub5'] not found in axis"

In [160]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Sweety      72    89    40    67
Harini      74    86    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [161]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Sweety      72    89    40    67
Harini      74    86    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [162]:
marks.drop('Sweety',inplace=True)

In [163]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Harini      74    86    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [165]:
marks.iloc[6][1]=55

In [166]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Harini      74    55    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [170]:
marks.iloc[0:8][2]=100

<ipython-input-170-593c0bb131dd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  marks.iloc[0:8][2]=100

In [171]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99    90     6
Bhargavi    99    90    80     8
Bhavani     87    98    70    90
Jyothsna    88    80    60     3
Sahithi     83    87    50     4
Harini      74    55    30    89
Paddu       71    67    20    50
Varsham     65    76    10    20

In [172]:
marks['Sub3']=100

In [173]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99   100     6
Bhargavi    99    90   100     8
Bhavani     87    98   100    90
Jyothsna    88    80   100     3
Sahithi     83    87   100     4
Harini      74    55   100    89
Paddu       71    67   100    50
Varsham     65    76   100    20

In [178]:
marks.iloc[:][3]=0

<ipython-input-178-df4f1447b0f0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  marks.iloc[1:][3]=0

In [175]:
marks

          Sub1  Sub2  Sub3  Sub4
Yathisha    98    98   100   100
Sushma      97    99   100     6
Bhargavi    99    90   100     8
Bhavani     87    98   100    90
Jyothsna    88    80   100     3
Sahithi     83    87   100     4
Harini      74    55   100    89
Paddu       71    67   100    50
Varsham     65    76   100    20

In [179]:
import pandas as pd

In [182]:
popul=pd.read_csv('DataSet.csv')
popul

    2001   2002  2003   2004   2005   2006  2007   2008   2009   2010
0     91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
1    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
2     91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
3    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
4    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
5    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
6    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
7    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
8     91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
9    120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
10   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
11   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
12    91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
13   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
14   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
15   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
16    91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
17   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
18    91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7
19   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
20   120  121.9   125  130.5  133.7  131.0   145  140.0  141.0  144.6
21    91   91.5    90   95.0   92.0   96.8    97   92.5   94.3   99.7

In [205]:
popul

,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
India,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
China,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
England,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
Australia,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
South Korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
North korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Pakisthan,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iris,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iraq,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India2,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India3India4,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India6,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India7,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India8,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India9,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India10,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India11,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India12,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India13,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India14,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India15,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7

In [183]:
popul.drop(21,)

RangeIndex(start=0, stop=22, step=1)

In [204]:
popul.drop(21,inplace=True,axis=1)

KeyError: '[21] not found in axis'

In [189]:
popul.shape

(22, 10)

In [190]:
popul.columns

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010'],
      dtype='object')

In [192]:
popul.index=['India','China','England','Australia','South Korea','North korea','Pakisthan','Iris','Iraq','India2','India3'
            'India4','India5','India6','India7','India8','India9','India10','India11','India12','India13','India14','India15']

In [193]:
popul

,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
India,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
China,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
England,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
Australia,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
South Korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
North korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Pakisthan,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iris,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iraq,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India2,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India3India4,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India5,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India6,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India7,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India8,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India9,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India10,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India11,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India12,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India13,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India14,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India15,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7

In [198]:
popul.drop('India5',inplace=True)

In [199]:
popul

,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
India,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
China,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
England,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
Australia,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
South Korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
North korea,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Pakisthan,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iris,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
Iraq,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India2,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India3India4,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India6,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India7,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India8,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India9,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India10,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India11,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India12,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7
India13,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India14,120,121.9,125,130.5,133.7,131.0,145,140.0,141.0,144.6
India15,91,91.5,90,95.0,92.0,96.8,97,92.5,94.3,99.7

In [206]:
xl=pd.read_excel('DATA.xlsx')
xl

     Name  IS  CN  IBD  SA  SPM  DP
0    Ravi  45  34  100  90   95  89
1    Raki  56  45  100  90   95  89
2  Ramesh  78  67  100  90   95  89
3   Ravi2  90  89  100  90   95  89
4   Radha  34  90  100  90   95  89